IDENTIFICATION DIVISION.
PROGRAM-ID. SALARY-CALC.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-SALARY PIC X(10) VALUE 0.
   01 WS-HRS PIC X(10) VALUE 0.

PROCEDURE DIVISION.
   ACCEPT WS-SALARY.
   COMPUTE WS-HOURS = WS-SALARY / 8.
   DISPLAY "DAILY Salary :  " WS-SALARY.
   DISPLAY "Hourly Salary : " WS-HRS.

STOP RUN.
